Revit 2026 API

# SolidGeometryOptions Properties

---

The SolidGeometryOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SolidTag | Optional solid tag for the Solid. |

#### Reference

SolidGeometryOptions Class

Autodesk.Revit.DB Namespace